Revit 2026 API

# FabricationServiceSetServicePaletteExclusions Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool SetServicePaletteExclusions(
	IList<int> excludedPalettes
)
```
```vb
Public Function SetServicePaletteExclusions (
	excludedPalettes As IList(Of Integer)
) As Boolean
```
```cpp
public:
bool SetServicePaletteExclusions(
	IList<int>^ excludedPalettes
)
```
```fsharp
member SetServicePaletteExclusions :
        excludedPalettes : IList<int> -> bool
```

#### Parameters

excludedPalettes IListInt32

#### Return Value

Boolean

#### Reference

FabricationService Class

Autodesk.Revit.DB Namespace